№1
Дан массив с числами. Найдите сумму квадратов элементов этого массива.
<?php
// $sum = 0;
// $arr = range(1,20);
// foreach ($arr as $value){
//     $sum += $value ** 2;
// }
// echo $sum;
?>

№2
Дан массив с числами. Найдите сумму квадратных корней элементов этого массива.
<?php
// $sum = 0;
// $arr = range(1,20);
// foreach ($arr as $value){
//     $sum += sqrt($value);
// }
// echo $sum;
?>

№3
Дан массив с числами. Найдите сумму положительных элементов этого массива.
<?php
// $arr = range(-10,20);
// $sum = 0;
// foreach ($arr as $value){
//     if ($value > 0){
//     $sum += $value; 
//     }
// }
// echo $sum;
?>

№4
Дан массив с числами. Найдите сумму тех элементов этого массива, которые больше нуля и меньше десяти.<?php
// $arr = range(-10,20);
// $sum = 0;
// foreach ($arr as $value){
//     if (($value > 0) && ($value < 10)){
//     $sum += $value; 
//     }
// }
// echo $sum;
// ?>


