<?php
//№1
//Заполните массив случайными числами из промежутка от 1 до 100.
//
//$numbers = [];
//$count = 10;
//
//for ($i = 0; $i < $count; $i++){
//    $numbers[] = random_int(1,100);
//}
//
//print_r($numbers);

//№2
//Дано некоторое число:
//12345
//Выведите в консоль все его символы с конца.

//$number = 12345;
//1 способ
//$str = (string)$number;
//echo strrev($str);
//2 способ
//for ($i = strlen($str)-1; $i>=0; $i--){
//    echo $str[$i];
//}
////3 способ
//while ($number > 0){
//    echo ($number % 10);
//    $number = (int)($number / 10);
//}

//№3
//Дан некоторый массив, например, вот такой:
//[1, 2, 3, 4, 5, 6]
//По очереди выведите в консоль подмассивы из двух элементов нашего массива:
//[1, 2]
//[3, 4]
//[5, 6]

//$array = [1,2,3,4,5,6];
//
//$size = count($array);
//
//for ($i = 0; $i < $size; $i += 2){
//    $newArr[] = [$array[$i], $array[$i+1]];
//}
//
//print_r($newArr);

//№4
//Даны два массива:
//
//$arr1 = [1, 2, 3];
//$arr2 = [4, 5, 6];
//Слейте эти массивы в новый массив:
//[1, 2, 3, 4, 5, 6]
//1 способ
//$arr1 = [1, 2, 3];
//$arr2 = [4, 5, 6];

//$result = $arr1;
//
//foreach ($arr2 as $item){
//    $result[] = $item;
//}
//
//print_r($result);

//2 способ
$arr1 = [1, 2, 3];
$arr2 = [4, 5, 6];

$result = array_merge($arr1, $arr2);

print_r($result);

// новый коммент

?>