№1
Выведите в консоль все целые числа от 1 до 100.
<?php
// for($i=1; $i <= 100; $i++){
//     echo $i . "\n";
// }
?>

№2
Выведите в консоль все целые числа от -100 до 0.

<?php
// for($i = -100; $i <= 0; $i++){
//     echo $i . "\n";
// }
?>
№3
Выведите в консоль все целые числа от 100 до 1.
<?php
// for($i = 100; $i >= 1; $i--){
//     echo $i . "\n";
// }
?>

№4
Выведите в консоль все четные числа из промежутка от 1 до 100.
<?php
// for ($i = 1; $i <= 100; $i++){
//     if ($i % 2 == 0){
//         echo $i . "\n";
//     } 
// }
?>

№5
Выведите в консоль все числа кратные трем в промежутке от 1 до 100.
<?php
// for($i = 1; $i <= 100; $i++){
//     if ($i % 3 ==0){
//         echo $i . "\n";
//     }
// }
?>